{
  "websiteTitle": "MMeowhite",
  "references": "/references.bib",
  "pages": {
    "home": {
      "avatar": {
        "init": "/images/avatar_init.jpg",
        "hovered": "/images/avatar_hover.jpg"
      },
      "name": {
        "nickName": "MMeowhite",
        "realName": "(Peng, Miao)"
      },
      "institution": "Sichuan University",
      "field": "MEDICINE / COMPUTER SCIENCE / MATHEMATICS / PHYSICS",
      "greeting": {
        "img": "/images/featuredImages/img.png",
        "title": "Hello, I'm MMeowhite (Peng, Miao)",
        "subtitle": "I'd like to say something...",
        "profile": "Hi! I am MMeowhite, a third-year Master's student in State Key Laboratory of Biotherapy at Sichuan University. My major is all of things in the world. <br/><br/>My goal is to push the boundaries of human knowledge and capabilities in Medicine, Computer Science, Mathematics, and Physics. I aspire to develop innovative and intelligent solutions that integrate principles from these fields to tackle complex real-world challenges. Specifically, I am interested in exploring methods that effectively and efficiently leverage multimodal data, advanced computational models, and mathematical frameworks to enhance understanding, decision-making, and problem-solving in science and healthcare. I am also passionate about discovering new interdisciplinary approaches that drive meaningful advancements.<br/><br/> News: I am currently researching on cancer neuroscience. Actively looking for communication and collaboration!"
      },
      "quote": {
        "words": "The most important thing in communication is hearing what isn’t said.",
        "author": "<cite>Claude Shannon</cite>"
      },
      "experienceSection": {
        "title": "Education",
        "edu": [
          {
            "period": "2018.09-2023.06",
            "university": "Chongqing Medical University",
            "logo": "/images/experience/ChongqingMedicalUniversity.jpg",
            "url": "https://www.scu.edu.cn",
            "degree": "Bachelor in Clinical Medicine (Direction: Radiology)",
            "gpa": "84 / 100",
            "course": "Medical Imaging and Diagnostic Radiology, Ultrasound Diagnostics, Interventional Radiology, Nuclear Medicine, Internal Medicine, Surgery, Obstetrics and Gynecology, Pediatrics, Physiology, Biochemistry and Molecular Biology, Pathology, Immunology, and Cell Biology",
            "research": "Molecular Mechanisms of Depression"
          },
          {
            "period": "2023.07-Present",
            "logo": "/images/experience/SichuanUniversity.jpg",
            "url": "https://www.cqmu.edu.cn",
            "university": "Sichuan University",
            "degree": "Master in Basic Medicine (Direction: Biochemistry and Molecular Biology )",
            "gpa": "87 / 100",
            "course": "The Basic Cellular and Molecular Principles of Pathogenesis, Medical Molecular Biology, Medicinal Biotechnology Frontier, Seperation and Purification Technology of Protein and Enzyme, Nucleic Acid Molecular Cloning Technique, Practical Histological Technique",
            "research": "Colorectal Cancer Liver Metastasis and Cancer Stem Cell-Targeted Immunotherapy"
          }
        ],
        "timeline": [
          {
            "id": "one",
            "year": "Jan 2020 - Jun 2023",
            "color": "#2c3e50",
            "percentage": 20,
            "content": "During my undergraduate research at the Institute of Life Sciences, Chongqing Medical University (Sep 2020 – Jun 2023), under the supervision of Assoc. Prof. Yun Xiu, I investigated the role of the NMDA receptor subunit NR3A in the molecular mechanisms of depression. My work involved performing qPCR, Western blotting, and selected behavioral assays on mouse models to explore gene expression and protein regulation related to depressive phenotypes. This research contributed to publications in the Journal of Affective Disorders."
          },
          {
            "id": "two",
            "year": "Jun 2023 - Present",
            "color": "#e74c3c",
            "percentage": 40,
            "content": "Since June 2023, as a graduate researcher under the supervision of Prof. Canhua Huang at the School of Basic Medicine & Forensic Medicine, Sichuan University, and the State Key Laboratory of Biotherapy, I have been conducting independent research on colorectal cancer stem cells and the mechanisms underlying liver metastasis. My work focuses on engineering exosomes that integrate redox disruption and RNA interference strategies to selectively target cancer stem cells for immunotherapy. In parallel, I analyze single-cell sequencing data to explore how colorectal cancer–derived exosomes influence hepatic lipid accumulation and modulate Kupffer cell signaling pathways. This research has led to a first-author manuscript submitted to the Journal of Nanobiotechnology and co-authored publications in Gut and Biomaterials."
          },
          {
            "id": "three",
            "year": "Jun 2024 - Present",
            "color": "#7b3",
            "percentage": 60,
            "content": "Since June 2024, as a graduate researcher at the School of Basic Medicine & Forensic Medicine, Sichuan University, and the State Key Laboratory of Biotherapy, I have been focusing on integrating multi-omics data through artificial intelligence approaches. My research involves combining single-cell, spatial transcriptomics, metabolomics, and microbiome datasets to develop deep learning predictive models using architectures such as Graph Neural Networks (GNNs) and Transformers. In parallel, I am working on predicting post-translational modifications from protein sequences by leveraging pre-trained protein language models (e.g., ESM, ProtBert) alongside CNN, LSTM, and Transformer frameworks. I have completed comprehensive data preprocessing and established the preliminary model framework, with ongoing efforts in model training and optimization."
          }
        ]
      },
      "featuredPublications": [
        {
          "authors": "Jiangjun Cao, Siyuan Qin, Bowen Li, Zhe Zhang, <b>Peng Miao</b>, Han Yan, Jiufei Duan, Bo He, Kai He, Peilan Peng, Lei Li, Hao Jiang, Zizhuo Xie, Jingwen Jiang, Xia Chen, Hai-Ning Chen, Canhua Huang.",
          "date": "June 12, 2025",
          "journal": "Gut",
          "featuredImages":[
            {
              "src": "/images/featuredImages/Gut_1.png",
              "link": ""
            },
            {
              "src": "/images/featuredImages/Gut_2.png",
              "link": ""
            }
          ],
          "title": "Extracellular vesicle-induced lipid dysregulation drives liver premetastatic niche formation in colorectal cancer",
          "url": "https://gut.bmj.com/content/early/2025/06/25/gutjnl-2025-334851.long",
          "abstract": "Liver metastasis is a leading cause of death in colorectal cancer (CRC). This study reveals that extracellular vesicles (EVs) from highly metastatic CRC cells promote hepatic premetastatic niche (PMN) formation by inducing lipid accumulation in the liver. Lipidomic and single-cell analyses showed that enhanced fatty acid (FA) synthesis in CRC cells increases prosteatogenic lipids in EVs, which are mainly taken up by Kupffer cells, triggering TNF-α secretion and further lipid accumulation. Inhibition of FA synthesis or hepatic lipid accumulation significantly reduced EV-induced metastasis. Patient-derived organoid experiments confirmed that blocking FA synthesis mitigates hepatic lipid deposition and liver metastasis. These findings identify FA synthesis inhibition as a promising strategy to prevent CRC liver metastasis.",
          "buttons": [
            {
              "name": "LINK",
              "logo": "",
              "link": "https://gut.bmj.com/content/early/2025/06/25/gutjnl-2025-334851.long"
            }
          ]
        },
        {
          "authors": "Mengmeng Zhang, Xiangru Kong, Jing Chen, Wenqin Liu, Can Liu, Xiaoyun Dou, Lin Jiang, Yanmin Luo, Mingrui Song, <b>Peng Miao</b>, Yong Tang, Yun Xiu ",
          "date": "July 1, 2023",
          "journal": "Journal of Affective Disorders",
          "featuredImages": [
            {
              "src": "/images/featuredImages/img.png",
              "link": "https://www.sciencedirect.com/user/identity/landing?code=jGe-vRhQMwishoa6V5yfEZklFkX62_14laUrwDwC&state=retryCounter%3D0%26csrfToken%3D2383bc0d-36f5-4667-a650-d8dcad41ddfd%26idpPolicy%3Durn%253Acom%253Aelsevier%253Aidp%253Apolicy%253Aproduct%253Ainst_assoc%26returnUrl%3D%252Fscience%252Farticle%252Fpii%252FS0165032723004305%26prompt%3Dnone%26cid%3Darp-774054fb-f3de-4710-9b5d-0c915f0a68d3"
            },
            {
              "src": "/images/featuredImages/img_1.png",
              "link": "https://www.sciencedirect.com/user/identity/landing?code=jGe-vRhQMwishoa6V5yfEZklFkX62_14laUrwDwC&state=retryCounter%3D0%26csrfToken%3D2383bc0d-36f5-4667-a650-d8dcad41ddfd%26idpPolicy%3Durn%253Acom%253Aelsevier%253Aidp%253Apolicy%253Aproduct%253Ainst_assoc%26returnUrl%3D%252Fscience%252Farticle%252Fpii%252FS0165032723004305%26prompt%3Dnone%26cid%3Darp-774054fb-f3de-4710-9b5d-0c915f0a68d3"
            },
            {
              "src": "/images/featuredImages/img_2.png",
              "link": "https://www.sciencedirect.com/user/identity/landing?code=jGe-vRhQMwishoa6V5yfEZklFkX62_14laUrwDwC&state=retryCounter%3D0%26csrfToken%3D2383bc0d-36f5-4667-a650-d8dcad41ddfd%26idpPolicy%3Durn%253Acom%253Aelsevier%253Aidp%253Apolicy%253Aproduct%253Ainst_assoc%26returnUrl%3D%252Fscience%252Farticle%252Fpii%252FS0165032723004305%26prompt%3Dnone%26cid%3Darp-774054fb-f3de-4710-9b5d-0c915f0a68d3"
            }
          ],
          "title": "Dysfunction of GluN3A subunit is involved in depression-like behaviors through synaptic deficits",
          "url": "https://www.sciencedirect.com/user/identity/landing?code=jGe-vRhQMwishoa6V5yfEZklFkX62_14laUrwDwC&state=retryCounter%3D0%26csrfToken%3D2383bc0d-36f5-4667-a650-d8dcad41ddfd%26idpPolicy%3Durn%253Acom%253Aelsevier%253Aidp%253Apolicy%253Aproduct%253Ainst_assoc%26returnUrl%3D%252Fscience%252Farticle%252Fpii%252FS0165032723004305%26prompt%3Dnone%26cid%3Darp-774054fb-f3de-4710-9b5d-0c915f0a68d3",
          "abstract": "GluN3A, an inhibitory subunit of N-methyl-d-aspartate receptors (NMDARs), plays an unclear role in depression. In this study, we examined GluN3A expression in a chronic restraint stress (CRS) mouse model of depression and explored its molecular mechanisms. We found that GluN3A expression was significantly reduced in the hippocampus of CRS mice, and restoring GluN3A expression alleviated depression-like behaviors. Furthermore, GluN3A knockout (KO) mice exhibited symptoms of anhedonia and despair, alongside downregulation of genes involved in synapse and axon development. Reduced PSD95 levels in GluN3A KO mice were rescued by viral re-expression of GluN3A, highlighting its crucial role in regulating synaptic function and depression-related behaviors. Despite these findings, the full mechanism by which GluN3A contributes to depression remains unclear.",
          "buttons": [
            {
              "name": "PDF",
              "logo": "",
              "link": "https://www.sciencedirect.com/user/identity/landing?code=jGe-vRhQMwishoa6V5yfEZklFkX62_14laUrwDwC&state=retryCounter%3D0%26csrfToken%3D2383bc0d-36f5-4667-a650-d8dcad41ddfd%26idpPolicy%3Durn%253Acom%253Aelsevier%253Aidp%253Apolicy%253Aproduct%253Ainst_assoc%26returnUrl%3D%252Fscience%252Farticle%252Fpii%252FS0165032723004305%26prompt%3Dnone%26cid%3Darp-774054fb-f3de-4710-9b5d-0c915f0a68d3"
            },
            {
              "name": "CODE",
              "logo": "",
              "link": "https://github.com/MMeowhite/Profile_Website_Template"
            },
            {
              "name": "Video",
              "logo": "",
              "link": "https://www.bilibili.com"
            }
          ]
        }
      ],
      "cv": "/cv_en.pdf",
      "contact": {
        "title": "Let's stay connected !",
        "subtitle": "Welcome to drop in with any questions, ideas, suggestions, or just to say hello!",
        "location": "<br />West China Campus, Sichuan University<br />No. 17 Section 3, South Renmin Road<br />Chengdu, Sichuan 610041 <br /> P.R. China",
        "api": {
          "name": "baidu",
          "address": "中国四川省成都市武侯区人民南路三段17号四川大学华西校区",
          "key": ""
        }
      }
    },
    "experience": {
      "education": [
        {
          "university": {
            "name": "Chongqing Medical University",
            "url": "https://www.cqmu.edu.cn/"
          },
          "time": "September 2018 - July 2023",
          "major": "Bachelor of Medicine in Medical Imaging (Radiology and Diagnostic Technology)",
          "GPA": "3.6 / 5.0",
          "course": "Medical Imaging and Diagnostic Radiology, Ultrasound Diagnostics, Interventional Radiology, Nuclear Medicine, Internal Medicine, Surgery, Obstetrics and Gynecology, Pediatrics, Physiology, Biochemistry and Molecular Biology, Pathology, Immunology, and Cell Biology"
        },
        {
          "university": {
            "name": "Sichuan university",
            "url": "https://www.scu.edu.cn/"
          },
          "time": "July 2023 - Present",
          "major": "Master of Medicine in Basic Medicine (Chemistry and Molecular Biology)",
          "GPA": "3.6 / 4.0",
          "course": "The Basic Cellular and Molecular Principles of Pathogenesis, Medical Molecular Biology, Medicinal Biotechnology Frontier, Seperation and Purification Technology of Protein and Enzyme, Nucleic Acid Molecular Cloning Technique, Practical Histological Technique"
        }
      ],
      "internships": [
        {
          "location": {
            "name": "The Beibei Affiliated Hospital of Chongqing Medical University",
            "url": "https://www.cq9yuan.com/"
          },
          "time": "Jan 2022 - Jun 2022",
          "work": "Rotated through the Hepatobiliary Surgery, Rheumatology & Immunology, and Gastroenterology departments, gaining systematic understanding of diagnostic approaches and treatment procedures for common diseases. Participated in case discussions and clinical documentation, improving clinical reasoning and medical record analysis skills."
        },
        {
          "location": {
            "name": "The Second Affiliated Hospital of Chongqing Medical University",
            "url": "https://www.sahcqmu.com/"
          },
          "time": "Jun 2022 - Jan 2023",
          "work": "Continued clinical training across relevant departments, mastering diagnostic approaches and treatment workflows for common conditions. Engaged in case discussions, clinical documentation, and assisted in certain surgical procedures."
        },
        {
          "location": {
            "name": "The University-Town Affiliated Hospital of Chongqing Medical University",
            "url": "http://www.uhcmu.com/"
          },
          "time": "Jan 2023 - Jun 2023",
          "work": "Rotated through the Radiology and Ultrasound departments, assisting attending physicians with image interpretation, ultrasound examinations, and some interventional procedures. Integrated imaging knowledge with research questions to provide clinical insights for subsequent studies."
        }
      ],
      "research": [
        {
          "time": "Jan 2020 - Jan 2022",
          "location": {
            "name": "Life Science Institute of Chongqing Medical University",
            "url": "https://basic.cqmu.edu.cn/info/1155/5668.htm"
          },
          "directors": [
            {
              "name": "Assoc.Prof.Xiu Yun",
              "link": "https://brain.cqmu.edu.cn/info/1026/1632.htm"
            }
          ],
          "work": "Under the supervision of Assoc. Prof. Xiu Yun, I studied the role of the inhibitory subunit of NMDA receptors, GluN3A, in the pathophysiology of depression. My responsibilities included performing animal behavioral experiments (such as sucrose preference test, forced swim test, and open field test) and recording data, conducting molecular biology assays (protein and RNA extraction, Western Blot, qPCR) to assess synaptic protein levels (e.g., PSD95) and gene expression changes, and participating in project discussions. This work resulted in a publication in the Journal of Affective Disorders. Through this project, I gained systematic experience in linking behavioral and molecular studies, and strengthened my skills in experimental design, data analysis, and scientific writing."
        },
        {
          "location": {
            "name": "West China school of Basic Medical Sciences & Forensic Medicine of Sichuan University",
            "url": "https://jcfy.scu.edu.cn/"
          },
          "time": "",
          "directors": [
            {
              "name": "Prof.Canhua Huang",
              "link": "http://hcanhua.cn/"
            }
          ],
          "work": "Supervised by Prof. Canhua Huang, my research focuses on colorectal cancer stem cells and liver metastasis, aiming to develop immunotherapeutic strategies targeting cancer stem cells. My work involves constructing engineered exosome delivery systems and combining redox disruption with RNA interference to enhance immunotherapy efficacy. Additionally, I investigate the tumor microenvironment in colorectal cancer liver metastasis, analyzing how CRC-derived exosomes influence hepatic lipid accumulation and Kupffer cell-mediated signaling using single-cell sequencing data. I am independently responsible for experimental design and execution, including exosome modification, RNA interference system construction, validation in cell and animal models, molecular assays (Western Blot, qPCR, ELISA), and phenotypic analyses (DNA damage, ROS detection, flow cytometry), as well as leading manuscript preparation and figure production. Research outcomes include a first-author manuscript submitted to Journal of Nanobiotechnology, and co-authorship on publications in Gut and Biomaterials."
        },
        {
          "location": {
            "name": "",
            "url": ""
          },
          "time": "July 2024 - Present",
          "directors": [
            {
              "name": "None",
              "link": ""
            }
          ],
          "work": "Since July 2024, I have been independently exploring multi-omics data integration using machine learning and deep learning for disease prediction and mechanistic studies. I integrate single-cell RNA-seq, spatial transcriptomics, metabolomics, and host-microbiome data, constructing deep learning predictive models such as graph neural networks (GNNs) and Transformers. For protein sequence analysis, I leverage pre-trained protein language models (ESM, ProtBert) to extract sequence features and apply CNNs, LSTMs, and Transformers for post-translational modification site prediction. The project has completed multi-omics data preprocessing and initial model framework construction, with the next steps involving model fine-tuning and training."
        }
      ],
      "skills": [
        {
          "field": "Computer Science",
          "list": {
            "Programming Languages": "C, Java, Linux, Python, R, MATLAB, Javascript, MySQL",
            "Framework and libraries": {
              "Bioinformatics": [
                "RNA-Seq quality control and data preprocessing: Trimming, Filtering, Alignment (STAR, HISAT2)",
                "Variant calling and annotation: SNPs, Indels, CNVs",
                "Bulk RNA-seq: Differential gene expression analysis, Alternative splicing analysis, GO/KEGG/GSEA enrichment analysis",
                "Single-cell RNA-Seq analysis (scRNA-Seq): Seurat V5, Monocle, Scanpy, Celltree",
                "Visualization of omics data: Heatmaps, Volcano plots, PCA, t-SNE, UMAP, Circos plots",
                "Multi-omics data integration analysis: WGS, WES, GWAS, RNA-Seq, ChIP-Seq, ATAC-seq, Metabolomics, Proteomics",
                "Machine learning in bioinformatics: Predictive models, Clustering algorithms (K-means, Hierarchical)"
              ],
              "Web development": "Full stack development: React, Bootstrap, Flask, Node.js"
            }
          }
        },
        {
          "field": "Medicine",
          "list": {
            "Clinical Skills": "History taking, Physical Examination, Vital Signs Monitoring, Emergency Skills etc.",
            "Molecular Biology Techniques": "qPCR, Western Blot, ELISA, RNAi, In Situ Hybridization",
            "Cell Biology Techniques": "Cell Culture and Transfection, Organoid Culture, Immunofluorescence, Flow Cytometry",
            "Animal Models": "Mouse Tumor Models Construction, Pharmacological Studies",
            "Scientific Writing": "Scientific Paper Writing, Literature Review, Research Proposal Preparation"
          }
        }
      ],
      "awardsAndHonors": [
        {
          "name": "Third-Class Scholarship for Advanced Individual in Technological Innovation",
          "unit": "Chongqing Medical University",
          "time": "September 2022",
          "desc": "Awarded for <b>leadership in \"The 2020 University Innovation Experiment Project\" on NMDA receptor NR3A knockout mice</b> and <b>contributions to the \"Sky Project in School of Life Sciences\" on the role of NR3A in depression molecular mechanism</b>, as well as for winning the <b>Excellence Award in \"The 8th Concept Cup at Chongqing Medical University\" for research proposal design on m6A methylation in autism mechanism</b>."
        }
      ]
    },
    "projects": {
      "title": "Selected Projects",
      "desc": "I enjoy making things. Here are a selection of projects that I have worked on over the years.",
      "list": [
        {
          "img": "/images/projects/personal_website.png",
          "title": "Personal Website",
          "url": "https://github.com/MMeowhite/Profile_Website_Template",
          "desc": "This project is built using React, Bootstrap, and Markdown. It has been published on GitHub and allows for quick personalization through simple configuration file edits. You can also easily deploy it to Netlify to create your own professional personal website.",
          "time": "February 23, 2025"
        },
        {
          "img": "/images/projects/ai_project.png",
          "title": "Introduction to Machine Learning and Deep Learning",
          "url": "https://github.com/MMeowhite/Ml-Dl-Fullstack-Guide",
          "desc": "This course is designed for beginners, providing a comprehensive introduction to all mainstream machine learning and deep learning models. It includes lecture slides (PPT), code notebooks, and real-world projects, covering mathematical foundations, model principles, practical implementation, and engineering deployment.",
          "time": "October 1, 2025"
        }
      ]
    }
  },
  "widgets": {
    "navbar": {
      "item1": {
        "name": "Home",
        "link": "#home"
      },
      "item2": {
        "name": "Education",
        "link": "#education"
      },
      "item3": {
        "name": "Experience",
        "link": "#experience"
      },
      "item4": {
        "name": "Publication",
        "link": "#publication"
      },
      "item6": {
        "name": "CV",
        "link": "#cv"
      },
      "item5": {
        "name": "Contact",
        "link": "#contact"
      }
    },
    "topNavBar": [
      {
        "title": "MMeowhite",
        "link": [
          {
            "name": "Bio",
            "link": "/"
          },
          {
            "name": "Experience",
            "link": "/experience"
          },
          {
            "name": "Publication",
            "link": "/publication"
          },
          {
            "name": "Projects",
            "link": "/projects"
          },
          {
            "name": "Blogs",
            "link": "/blogs"
          }
        ]
      }
    ],
    "iconNavComponent": [
      {
        "type": "email",
        "icon": "/images/link_icon/gmail.svg",
        "link": "mailto:miaopeng@stu.scu.edu.cn"
      },
      {
        "type": "github",
        "icon": "/images/link_icon/github.svg",
        "link": "https://github.com/MMeowhite"
      },
      {
        "type": "google_scholar",
        "icon": "/images/link_icon/googlescholar.svg",
        "link": "https://scholar.google.com/citations?user=Y5lz1jMAAAAJ&hl=en"
      },
      {
        "type": "linkedin",
        "icon": "/images/link_icon/linkedin.svg",
        "link": "https://www.linkedin.com/in/peng-miao-89324a341/"
      },
      {
        "type": "youtube",
        "icon": "/images/link_icon/youtube.svg",
        "link": "https://www.youtube.com/@pengmiao-bmm"
      }
    ]
  }
}